          IDENTIFICATION DIVISION.
5)	
6)	       PROGRAM-ID.  SEQ3000.
7)	
8)	       ENVIRONMENT DIVISION.
9)	
10)	     INPUT-OUTPUT SECTION.
11)	
12)	     FILE-CONTROL.
13)	
14)	           SELECT EMPTRAN  ASSIGN TO EMPTRAN.
15)	           SELECT OLDEMP   ASSIGN TO OLDEMP.
16)	           SELECT NEWEMP   ASSIGN TO NEWEMP
17)	                        FILE STATUS IS NEWEMP-FILE-STATUS.
18)	           SELECT ERRTRAN3 ASSIGN TO ERRTRAN3
19)	                           FILE STATUS IS ERRTRAN-FILE-STATUS.
20)	
21)	      DATA DIVISION.
22)	
23)	      FILE SECTION.
24)	
25)	      FD  EMPTRAN3.
26)	
27)	   01 TRANSACTION-RECORD            PIC X(50).
28)	
29)	      FD  OLDEMP.
30)	
31)	   01 OLD-MASTER-RECORD             PIC X(57).
32)	
33)	      FD  NEWEMP.
34)	
35)	   01 NEW-MASTER-RECORD.
36)	
37)	      05 NM-EMPLOYEE-ID             PIC X(5).
38)	      05 NM-EMPLOYEE-NAME           PIC X(30).
39)	      05 NM-DEPART-CODE             PIC X(5).
40)	      05 NM-JOB-CLASS               PIC X(2).
41)	      05 NM-ANNUAL-SALARY           PIC S9(5)V99.
42)	      05 NM-VACACTION-HOURS         PIC S9(3).
43)	      05 NM-SICK-HOURS              PIC S9(3)V99.
44)	
45)	      FD  ERRTRAN.
46)	
47)	   01 ERROR-TRANSACTION             PIC X(61).
48)	
49)	      WORKING-STORAGE SECTION.
50)	
51)	   01 SWITCHES.
52)	      05 ALL-RECORDS-PROCESSED-SWITCH
                                        PIC X        VALUE "N".
53)	         88 ALL-RECORDS-PROCESSED                VALUE "Y".
54)	      05 NEED-TRANSACTION-SWITCH    PIC X        VALUE "Y".
55)	         88 NEED-TRANSACTION                     VALUE "Y".
56)	      05 NEED-MASTER-SWITCH         PIC X        VALUE "Y".
57)	         88 NEED-MASTER                          VALUE "Y".
58)	      05 WRITE-MASTER-SWITCH        PIC X        VALUE "N".
59)	         88 WRITE-MASTER                         VALUE "Y".
60)	
61)	   01 FILE-STATUS-FIELDS.
62)	      05 NEWEMP-FILE-STATUS         PIC XX.
63)	         88 NEWEMP-SUCCESSFUL                    VALUE "00".
64)	      05 ERRTRAN-FILE-STATUS        PIC XX.
65)	         88 ERRTRAN-SUCCESSFUL                   VALUE "00".
66)	
67)	   01 EMPLOYEE-TRANSACTION.
68)	      05 ET-TRANSACTION-CODE        PIC X.
69)	         88 DELETE-RECORD                        VALUE "D".
70)	         88 ADD-RECORD                           VALUE "A".
71)	         88 CHANGE-RECORD                        VALUE "C".
72)	      05 ET-MASTER-DATA.
73)	         10 ET-EMPLOYEE-ID          PIC X(5).
74)	         10 ET-EMPLOYEE-NAME        PIC X(30).
75)	         10 ET-DEPART-CODE          PIC X(5).
76)	         10 ET-JOB-CLASS            PIC X(2).
77)	         10 ET-ANNUAL-SALARY        PIC S9(5)V99.
78)	
79)	   01 EMPLOYEE-MASTER-RECORD.
80)	      05 EM-EMPLOYEE-ID             PIC X(5).
81)	      05 EM-EMPLOYEE-NAME           PIC X(30).
82)	      05 EM-DEPART-CODE             PIC X(5).
83)	      05 EM-JOB-CLASS               PIC X(2).
84)	      05 EM-ANNUAL-SALARY           PIC S9(5)V99.
85)	      05 EM-VACACTION-HOURS         PIC S9(3).
86)	      05 EM-SICK-HOURS              PIC S9(3)V99.
87)	
88)	      PROCEDURE DIVISION.
89)	
90)	   000-MAINTAIN-EMPLOYEE-FILE.
91)	
92)	       OPEN INPUT OLDEMP
93)	          EMPTRAN
94)	            OUTPUT NEWEMP
95)	          ERRTRAN.
96)	       PERFORM 300-MAINTAIN-EMPLOYEE-RECORD
97)	          UNTIL ALL-RECORDS-PROCESSED.
98)	       CLOSE EMPTRAN
99)	             OLDEMP
100)	            NEWEMP
101)	            ERRTRAN.
102)	      STOP RUN.
103)	
104)	  300-MAINTAIN-EMPLOYEE-RECORD.
105)	
106)	      IF NEED-TRANSACTION
107)	         PERFORM 310-READ-EMPLOYEE-TRANSACTION
108)	         MOVE "N" TO NEED-TRANSACTION-SWITCH.
109)	      IF NEED-MASTER
110)	         PERFORM 320-READ-OLD-MASTER
111)	         MOVE "N" TO NEED-MASTER-SWITCH.
112)	      PERFORM 330-MATCH-MASTER-TRAN.
113)	      IF WRITE-MASTER
114)	         PERFORM 340-WRITE-NEW-MASTER
115)	         MOVE "N" TO WRITE-MASTER-SWITCH.
116)	
117)	  310-READ-EMPLOYEE-TRANSACTION.
118)	
119)	      READ EMPTRAN INTO EMPLOYEE-TRANSACTION
120)	      AT END
121)	         MOVE HIGH-VALUE TO ET-EMPLOYEE-ID.
122)	
123)	  320-READ-OLD-MASTER.
124)	
125)	      READ OLDEMP INTO EMPLOYEE-MASTER-RECORD
126)	      AT END
127)	         MOVE HIGH-VALUE TO ET-EMPLOYEE-ID.
128)	
129)	  330-MATCH-MASTER-TRAN.
130)	
131)	      IF EM-EMPLOYEE-ID > ET-EMPLOYEE-ID
132)	         PERFORM 350-PROCESS-HI-MASTER
133)	      ELSE
              IF EM-EMPLOYEE-ID < ET-EMPLOYEE-ID
134)	            PERFORM 360-PROCESS-LO-MASTER
135)	         ELSE
136)	            PERFORM 370-PROCESS-MAST-TRAN-EQUAL.
137)	
138)	  340-WRITE-NEW-MASTER.
139)	
140)	      WRITE NEW-MASTER-RECORD.
141)	      IF NOT NEWEMP-SUCCESSFUL
142)	         DISPLAY "WRITE ERROR ON NEWMAST FOR ITEM NUMBER "
143)	                 EM-EMPLOYEE-ID
144)	         DISPLAY "FILE STATUS CODE IS " NEWEMP-FILE-STATUS
145)	         SET ALL-RECORDS-PROCESSED TO TRUE.
146)	
147)	  350-PROCESS-HI-MASTER.
148)	
149)	      IF ADD-RECORD
150)	         PERFORM 380-APPLY-ADD-TRANSACTION
151)	      ELSE
152)	         PERFORM 390-WRITE-ERROR-TRANSACTION.
153)	
154)	  360-PROCESS-LO-MASTER.
155)	
156)	      MOVE EMPLOYEE-MASTER-RECORD TO NEW-MASTER-RECORD.
157)	      SET WRITE-MASTER TO TRUE.
158)	      SET NEED-MASTER TO TRUE.
159)	
160)	  370-PROCESS-MAST-TRAN-EQUAL.
161)	
162)	      IF EM-EMPLOYEE-ID = HIGH-VALUES
163)	         SET ALL-RECORDS-PROCESSED TO TRUE
164)	      ELSE
165)	         IF DELETE-RECORD
166)	            PERFORM 400-APPLY-DELETE-TRANSACTION
167)	         ELSE
168)	            IF CHANGE-RECORD
169)	               PERFORM 410-APPLY-CHANGE-TRANSACTION
170)	            ELSE
171)	               PERFORM 390-WRITE-ERROR-TRANSACTION.
172)	
173)	  380-APPLY-ADD-TRANSACTION.
174)	
175)	      MOVE ET-EMPLOYEE-ID TO NM-EMPLOYEE-ID.
176)	      MOVE ET-EMPLOYEE-NAME TO NM-EMPLOYEE-NAME.
177)	      MOVE ET-DEPART-CODE TO NM-DEPART-CODE.
178)	      MOVE ET-JOB-CLASS TO NM-JOB-CLASS.
179)	      MOVE ET-ANNUAL-SALARY TO NM-ANNUAL-SALARY.
180)	
181)	      SET WRITE-MASTER TO TRUE.
182)	      SET NEED-TRANSACTION TO TRUE.
183)	
184)	  390-WRITE-ERROR-TRANSACTION.
185)	
186)	      WRITE ERROR-TRANSACTION FROM EMPLOYEE-TRANSACTION.
187)	      IF NOT ERRTRAN-SUCCESSFUL
188)	         DISPLAY "WRITE ERROR ON ERRTRAN FOR EMPLOYEE ID "
189)	                 ET-EMPLOYEE-ID
190)	         DISPLAY "FILE STATUS CODE IS " ERRTRAN-FILE-STATUS
191)	         SET ALL-RECORDS-PROCESSED TO TRUE
192)	      ELSE
193)	         SET NEED-TRANSACTION TO TRUE.
194)	
195)	  400-APPLY-DELETE-TRANSACTION.
196)	
197)	      SET NEED-MASTER TO TRUE.
198)	      SET NEED-TRANSACTION TO TRUE.
199)	
200)	  410-APPLY-CHANGE-TRANSACTION.
201)	
202)	      IF ET-ITEM-DESC NOT = SPACE
203)	         MOVE ET-ITEM-DESC TO EM-ITEM-DESC.
204)	      IF ET-UNIT-COST NOT = ZERO
205)	         MOVE ET-UNIT-COST TO EM-UNIT-COST.
206)	      IF ET-UNIT-PRICE NOT = ZERO
207)	         MOVE ET-UNIT-PRICE TO EM-UNIT-PRICE.
208)	      IF ET-REORDER-POINT NOT = ZERO
209)	         MOVE ET-REORDER-POINT TO EM-REORDER-POINT.
210)	      SET NEED-TRANSACTION TO TRUE.